In [1]:
!wget -c https://ai100-fileentity.cupoy.com/ml100/homework/data/1582795766653/titanic_train.csv?t=1582795819472 -O titanic_train.csv

--2020-07-23 11:33:35--  https://ai100-fileentity.cupoy.com/ml100/homework/data/1582795766653/titanic_train.csv?t=1582795819472
Resolving ai100-fileentity.cupoy.com (ai100-fileentity.cupoy.com)... 13.224.29.81, 13.224.29.112, 13.224.29.13, ...
Connecting to ai100-fileentity.cupoy.com (ai100-fileentity.cupoy.com)|13.224.29.81|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 60302 (59K) [application/octet-stream]
Saving to: ‘titanic_train.csv’

titanic_train.csv   100%[===================>]  58.89K  --.-KB/s    in 0.009s

2020-07-23 11:33:35 (6.14 MB/s) - ‘titanic_train.csv’ saved [60302/60302]

In [3]:
import numpy as np
import pandas
from sklearn.preprocessing import MinMaxScaler, StandardScaler
from sklearn.model_selection import cross_val_score
from sklearn.linear_model import LogisticRegression

df_titanic_train=pandas.read_csv('titanic_train.csv')
df_titanic_train.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [5]:

train_Y=df_titanic_train['Survived']
id=df_titanic_train['PassengerId']
df_train=df_titanic_train.drop(['PassengerId','Survived'],axis=1)
df_test=df_titanic_train.drop(['PassengerId'],axis=1)
df=pandas.concat([df_train,df_test])
df

     Pclass  ... Survived
0         3  ...      NaN
1         1  ...      NaN
2         3  ...      NaN
3         1  ...      NaN
4         3  ...      NaN
..      ...  ...      ...
886       2  ...      0.0
887       1  ...      1.0
888       3  ...      0.0
889       1  ...      1.0
890       3  ...      0.0

[1782 rows x 11 columns]

In [6]:
#只取 int64, float64 兩種數值型欄位, 存於 num_features 中
num_features = []
for dtype, feature in zip(df.dtypes, df.columns):
    if dtype == 'float64' or dtype == 'int64':
        num_features.append(feature)
print(f'{len(num_features)} Numeric Features : {num_features}\n')

6 Numeric Features : ['Pclass', 'Age', 'SibSp', 'Parch', 'Fare', 'Survived']

In [7]:
# 削減文字型欄位, 只剩數值型欄位
df = df[num_features]
train_num = train_Y.shape[0]
df.head()

   Pclass   Age  SibSp  Parch     Fare  Survived
0       3  22.0      1      0   7.2500       NaN
1       1  38.0      1      0  71.2833       NaN
2       3  26.0      0      0   7.9250       NaN
3       1  35.0      1      0  53.1000       NaN
4       3  35.0      0      0   8.0500       NaN

# 作業1
試著在補空值區塊, 替換並執行兩種以上填補的缺值, 看看何者比較好?

In [8]:
# NA補-1
df1=df.fillna(-1)
train_X=df1[:train_num]
estimator=LogisticRegression()
cross_val_score(estimator,train_X,train_Y,cv=5).mean()

0.6981796497395015

In [9]:
# NA補0
df2=df.fillna(0)
train_X=df2[:train_num]
estimator=LogisticRegression()
cross_val_score(estimator,train_X,train_Y,cv=5).mean()

0.6992969681752557

In [10]:
# NA補平均值
df3=df.fillna(df.mean())
train_X=df3[:train_num]
estimator=LogisticRegression()
cross_val_score(estimator,train_X,train_Y,cv=5).mean()

0.6947900320130562

# 作業2
使用不同的標準化方式 ( 原值 / 最小最大化 / 標準化 )，搭配羅吉斯迴歸模型，何者效果最好?

In [11]:
# 最大最小化
df4=df.fillna(-1)
df4_temp=MinMaxScaler().fit_transform(df4)
train_X=df4_temp[:train_num]
estimator=LogisticRegression()
cross_val_score(estimator,train_X,train_Y,cv=5).mean()

0.70041428661101

In [12]:
# 標準化
df5=df.fillna(-1)
df5_temp=StandardScaler().fit_transform(df5)
train_X=df5_temp[:train_num]
estimator=LogisticRegression()
cross_val_score(estimator,train_X,train_Y,cv=5).mean()

0.6981733726696377